In [1]:
import pandas as pd

In [2]:
name = pd.Series(["小陈", "小李", "小王", "小张", "小赵", "小周"],
                 index=["001", "002", "003", "004", "005", "006"])
gender = pd.Series(["女", "女", "男", "男", "女", "男"],
                index=["006", "005", "004", "003", "002", "001"])
height = pd.Series([172.5, 168.0, 178.2, 181.3, 161.7],
                   index=["001", "002", "003", "004", "005"])

In [3]:
student = pd.DataFrame({'姓名':name,'性别':gender,'身高':height})
student

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女    NaN

#### 获取开头/结尾/随机N行

#### 用来快速检查数据

In [4]:
student.head(2)

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0

In [5]:
student.tail(2)

     姓名 性别     身高
005  小赵  女  161.7
006  小周  女    NaN

In [6]:
student.sample(2)

     姓名 性别     身高
003  小王  男  178.2
002  小李  女  168.0

#### 列数太多或值太长展示不全可以用set_option方法调整列数或值长度展示的上限

#### ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

## 评估丢失数据用info方法（注意不要忘记括号）

In [9]:
student.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 001 to 006
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      6 non-null      object
 1   性别      6 non-null      object
 2   身高      5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 364.0+ bytes

### 还可以用isnull方法

In [10]:
student.isnull()

        姓名     性别     身高
001  False  False  False
002  False  False  False
003  False  False  False
004  False  False  False
005  False  False  False
006  False  False   True

### 再用sum方法求和

In [11]:
student.isnull().sum()

姓名    0
性别    0
身高    1
dtype: int64

#### True和False用于数学计算是分别为1，0

#### 可以计算单独一列也可以直接计算每列

In [12]:
student['身高'].isnull().sum()

np.int64(1)

### 提取变量缺失的行1.没有sum2.是单独一列

In [16]:
student[student['身高'].isnull()]

     姓名 性别  身高
006  小周  女 NaN

#### ~~~~~~~~~~~~~~~~~~~~~~~~

## 评估重复数据

### 用duplicated在Series中重复数据为True在DateFrame中只有两行完全相同才为True

In [17]:
student.duplicated()

001    False
002    False
003    False
004    False
005    False
006    False
dtype: bool

### 若要同时查看几个变量是否重复可以给duplicated传入可选参数subset赋值给一个列表

In [18]:
student.duplicated(subset=['姓名','身高'])

001    False
002    False
003    False
004    False
005    False
006    False
dtype: bool

### 一样的方法提取行

In [19]:
student[student.duplicated(subset=['姓名','身高'])]

Empty DataFrame
Columns: [姓名, 性别, 身高]
Index: []

## 评估不一致数据

### 可以用value_counts方法看到某列下所有值的种类以及出现次数

## 评估错误数据

### 可以用sort_values方法对值进行排序